w06/d05/NineNineCats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    @cat = Cat.find_by(id: cat_params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "F"], ["description", "    \r\nLook at those paws"], ["updated_at", "2021-10-11 00:51:20.264925"], ["id", 3]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update_attributes(cat_params)