w06/d02/first_routes/FirstRoutes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def index
    artwork = Artwork.all

INSERT INTO "artworks" ("title", "img_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Mona Lisa"], ["img_url", "asdlfkjasd"], ["artist_id", 2]]
---
  def create
    artwork = Artwork.new(check_params)
    if artwork.save