w06/d02/first_routes/FirstRoutes/app/controllers/users_controller.rb

INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "\"Walter\""]]
---
  def create
    user = User.new(check_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "Alex"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
    if user.update(check_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    user = User.find(params[:id])
    user.delete